Attribute VB_Name = "ApplicationEx"
Option Explicit
Option Private Module

'====================================================================================================
'
' アプリケーションの拡張モジュール
'
'====================================================================================================

'====================================================================================================
' 画面描画を抑制します
'----------------------------------------------------------------------------------------------------
' IN : isSuppress 抑制するか否か
'====================================================================================================
Public Sub SuppressScreenDrawing(isSuppress As Boolean)
    Application.ScreenUpdating = Not isSuppress
    Application.DisplayAlerts = Not isSuppress
End Sub


