Attribute VB_Name = "DatabaseModelFactory"
Option Explicit
Option Private Module

'====================================================================================================
'
' データベースモデルのファクトリー
'
'====================================================================================================

'====================================================================================================
' メンバ変数
'====================================================================================================
Dim mDatabaseModel As DatabaseModel     ' データベースモデル


'====================================================================================================
' データベースモデルを生成します
'====================================================================================================
Public Function Create() As Object
    If mDatabaseModel Is Nothing Then
        Set mDatabaseModel = New DatabaseModel
    End If
    Set Create = mDatabaseModel
End Function


