Attribute VB_Name = "DataEntryTool"
Option Explicit
Option Private Module

'====================================================================================================
'
' データ投入ツールのモジュール
'
'====================================================================================================

'====================================================================================================
' テーブルシート作成
'====================================================================================================
Public Sub CreateTableSheet()
    Dim controller As TableSheetController

    Set controller = New TableSheetController
    Call controller.Execute
End Sub

'====================================================================================================
' データ登録
'====================================================================================================
Public Sub RegisterData()
    Call ExecuteDataEntry(EntryType.Register)
End Sub


'====================================================================================================
' データ更新
'====================================================================================================
Public Sub UpdateData()
    Call ExecuteDataEntry(EntryType.Update)
End Sub


'====================================================================================================
' データ削除
'====================================================================================================
Public Sub DeleteData()
    Call ExecuteDataEntry(EntryType.Delete)
End Sub


'====================================================================================================
' データ投入の実行
'----------------------------------------------------------------------------------------------------
' IN : xEntryType 投入種別
'====================================================================================================
Private Sub ExecuteDataEntry(xEntryType As EntryType)
    Dim controller As DataEntryController

    Set controller = New DataEntryController
    Call controller.Execute(xEntryType)
End Sub
