Attribute VB_Name = "MsgBoxEx"
Option Explicit
Option Private Module

'====================================================================================================
'
' メッセージボックスの拡張モジュール
'
'====================================================================================================

'====================================================================================================
' 情報メッセージを表示します
'----------------------------------------------------------------------------------------------------
' IN : message メッセージ
'    : detailMessage 詳細メッセージ
'====================================================================================================
Public Sub Information(ByVal message As String)
    MsgBox message, vbOKOnly + vbInformation
End Sub


'====================================================================================================
' 警告メッセージを表示します
'----------------------------------------------------------------------------------------------------
' IN : message メッセージ
'    : detailMessage 詳細メッセージ
'====================================================================================================
Public Sub Warning(ByVal message As String, Optional ByVal detailMessage As String = "")
    If detailMessage <> "" Then
        message = message & vbNewLine & vbNewLine & detailMessage
    End If
    MsgBox message, vbOKOnly + vbExclamation
End Sub


'====================================================================================================
' エラーメッセージを表示します
'----------------------------------------------------------------------------------------------------
' IN : message メッセージ
'    : detailMessage 詳細メッセージ
'====================================================================================================
Public Sub Error(message As String, detailMessage As String)
    MsgBox message & vbNewLine & vbNewLine & detailMessage, vbOKOnly + vbCritical
End Sub


